<!DOCTYPE html>
<html lang="es">
  <head>
    <meta charset="UTF-8" />
    <title>Secciones y l&iacute;neas generales de un documento HTML5</title>
    <link href="css/styles.css" rel="stylesheet" type="text/css" />
    <link rel="stylesheet" href="../../Web principal/css/styles.css">
    <link
      href="https://fonts.googleapis.com/css2?family=Roboto&display=swap"
      rel="stylesheet"
    />
  </head>
  <body>
    <header>
      <h1>Secciones y l&iacute;neas generales de un documento HTML5</h1>
    </header>

    <section>
      La especificaci&oacute;n HTML5 trae muchos nuevos elementos a los
      desarrolladores web, permiti&eacute;ndoles describir la estructura de un
      documento web con sem&aacute;ntica estandarizada. Este documento describe
      estos elementos y c&oacute;mo usarlos para definir el perfil de cualquier
      documento.
    </section>

    <section>
      <h2>Problemas resueltos por HTML5</h2>

      <p>
        La definici&oacute;n de la estructura de un documento en HTML 4 y su
        algoritmo de perfilado es muy tosco y genera numerosos problemas:
      </p>

      <p>
        HTML5 quita la necesidad de elementos &lt;div&gt; para definir secciones
        sem&aacute;nticas sin definir valores espec&iacuteficos para los
        atributos class, introduciendo un nuevo elemento, &lt;section&gt;, el
        elemento de secci&oacute;n HTML.<br />
        Mezclar varios documentos es dif&iacute;cil: la inclusi&oacute;n de un
        sub-documento en un documento principal. Esto se resuelve en HTML5 con
        los elementos de seccionado (&lt;article&gt;, &lt;section&gt;,
        &lt;nav&gt; y &lt;aside&gt;) son siempre subsecciones de su
        secci&oacute;n ancestra m&aacute;s cercana.<br />
        HTML5 introduce el elemento &lt;hgroup&gt; que oculta todos los
        elementos de cabecera excepto el primero de m&aacute;s alto rango (por
        ejemplo, &lt;hgroup&gt;&lt;h1&gt;Justine&lt;/h1&gt;&lt;h2&gt;Les
        Malheurs de la Vertu&lt;/h2&gt;&lt;/hgroup&gt; crea el perfil 1.
        Justine).<br />
        Un documento puede tener secciones especiales conteniendo
        informaci&oacute;n relacionada que no es parte del flujo principal.
        HTML5 introduce el elemento &lt;aside&gt; permitiendo a dichas secciones
        no ser parte del perfil principal.<br />
        Hay informaci&oacute;n relacionada no al documento pero si al sitio
        entero, como logos, men&uacute;s, tablas de contenidos, o
        informaci&oacute;n de derechos de autor y notas legales. Para ese
        prop&oacute;sito, HTML5 introduce tres elementos de secci&oacute;n
        espec&iacute;ficos: &lt;nav&gt; para colecciones de enlaces, como una
        tabla de contenidos, &lt;footer&gt; y &lt;header&gt; informaci&oacute;n
        relacionada con el sitio.
      </p>

      <p>
        De manera m&aacute;s general, HTML5 trae precisi&oacute;n a las
        caracter&iacute;sticas de seccionado y cabecera, permitiendo a los
        perfiles de documento ser predecibles y usados por el navegador para
        mejorar la experiencia de usuario.
      </p>
    </section>

    <section>
      <h2>El algoritmo de perfilado de HTML5</h2>
      <article>
        <h3>Definiendo secciones en HTML5</h3>

        Todo el contenido incluido dentro del elemento &lt;body&gt; es parte de
        una secci&oacute;n. Las secciones en HTML5 pueden ser anidadas.
        Adem&aacute;s de la secci&oacute;n principal, definida por el elemento
        &lt;body&gt;, los l&iacute;mites de la secci&oacute;n son definidos
        expl&iacute;cita o impl&iacute;citamente. La secciones definidas
        expl&iacute;citamente son el contenido definido en las etiquetas
        &lt;body&gt;, &lt;section&gt;, &lt;article&gt;, &lt;aside&gt;,
        &lt;footer&gt;, &lt;header&gt;, y &lt;nav&gt;. Nota: Cada secci&oacute;n
        puede tener su propia jerarqu&iacute;a de cabeceras. Por lo tanto,
        incluso una secci&oacute;n anidada puede tener un elemento &lt;h1&gt;.
        Consulte tambi&eacute;n Definiendo cabeceras en HTML5.
      </article>
    </section>

    <section>
      <h2>Ejemplo:</h2>
      &lt;section&gt; <br />
      &emsp;&lt;h1&gt;Forest elephants&lt;/h1&gt;<br />
      &lt;section&gt; <br />
      &emsp;&lt;h1&gt;Introduction&lt;/h1&gt;<br />
      &emsp;&lt;p&gt;In this section, we discuss the lesser known forest
      elephants. <br />
      &lt;/section&gt;<br />
      &lt;section&gt;<br />
      &emsp;&lt;h1&gt;Habitat&lt;/h1&gt;<br />
      &emsp; &lt;p&gt;Forest elephants do not live in trees but among them.<br />
      &lt;/section&gt;<br />
      &lt;aside&gt; <br />&emsp;&lt;p&gt;advertising block<br />
      &emsp;&lt;/aside&gt;<br />
      &lt;/section&gt;<br />
      &lt;footer&gt;<br />
      &emsp;&lt;p&gt;(c) 201<a></a>0 The Example company &lt;/footer&gt;
    </section>

    <footer class="footerBtn">
      <a
        href="../../Web principal/index.html"
        class="btnIndice"
        data-toggle="tooltip"
        title="Ver índice de la web"
        >Ir a índice</a
      >
    </footer>
  </body>
</html>
